[
  {
    "id": 2,
    "title": "Zuhlke Internship\r",
    "date": "November 16, 2021",
    "time": "18:35",
    "thumbnail": "http://www.realwire.com/writeitfiles/Zuehlke_Logo_web.jpg\r",
    "content": "At Zuhlke I worked alongside experienced developers for 3 months. As part of an internal team, our mission was to create the perfect walking application. The final result was Walker: a web app, which suggests the sunniest time of the day to go on a walk. In addition, Walker calculates a route based on user preferences, such as pace, temperature and distance, while always prioritizing green areas. Users are able to record their walks and log them for future references. Try out Walker for yourself: <https://master.d2su8ceb1kjqz8.amplifyapp.com/> (UPDATE: backend has been disconnected)\r\n\r\nIn addition to the development cycles, I was exposed to Masterclasses from professionals in different specialisations. I learnt and got to dive myself into advanced Data Science, Project Management, Consulting, Requirement Gathering and Team Programming Cultures.\r\n\r\nMy role and technical details:\r\n\r\n* Developed a Progressive Web App according to client demands\r\n* Followed professional agile industry standards (XP)\r\n* Built and hosted a full stack web app using React, Django, AWS, MongoDB\r\n* Applied Test Driven Development (TDD), trunk Based Development and Pair Programming\r\n* Conducted User Testing",
    "demo": "https://youtu.be/0AqxVt9O3Pk\r",
    "company": "Zuhlke\r",
    "companyLink": "https://www.zuehlke.com/en\r",
    "timePeriod": "June - September 2021\r"
  },
  {
    "id": 1,
    "title": "CTO at Yakera\r",
    "date": "November 17, 2021",
    "time": "12:34",
    "thumbnail": "/images/yakeralogo.webp\r",
    "content": "Yakera is a crowdfunding platform that changes how humanitarian aid is delivered around the world. We leverage the power of storytelling to build global solidarity and accelerate international development. Our mission is to empower individuals to tell their stories and create a secure pathway for cash transfers across borders.\r\n\r\nIn early 2020, we built a static website that served as an About Us page, we used that page to spread awareness and promote our GoFundMe Campaign, which raised 5000$.\r\n\r\nIn late 2020, we redesigned the website and connected it to our initial backend. People could visit our website and make a supportive donation to help prepare the team for its pilot launch. We raised another 7000$ through that.\r\n\r\nIn early 2021, we launched our Community Pilot. We displayed 36 campaigns and advertised them through our social media, raising in total 8000$ which we gave 100% to the recipients.\r\n\r\nIn the summer of 2021, we expanded our development team to 7 developers and hired a designer. We rebranded the website and built a solid and documented back end. We have now launched our official website, where recipients can register and create their own campaigns. If you have read this far it means you are interested in my work, I, therefore, invite you to head over to <https://yakera.org/campaigns> and chip in for the campaigns.\r\n\r\nMy role and technical details:\r\n\r\n* Responsible for the development cycles\r\n* In charge of the development team (4 backend, 4 front end)\r\n* Part of the Executive Team of Yakera\r\n* Responsible for the UX and user journey through the werbsite\r\n* Website built in React and Node, hosted on Netlify",
    "demo": "https://www.yakera.org/\r",
    "company": "Yakera\r",
    "companyLink": "https://www.yakera.org/\r",
    "timePeriod": "March 2020 - present\r"
  },
  {
    "id": 3,
    "title": "Business Analyst at Imago\r",
    "date": "November 17, 2021",
    "time": "12:33",
    "thumbnail": "https://imago.cs.manchester.ac.uk/wp-content/uploads/2020/09/imago-mini-logo.png\r",
    "content": "We created a progressive web application using React to introduce members of the public and other interested parties to current issues and innovations in bioenergy, for the [UK Supergen Bioenergy Hub](https://www.supergen-bioenergy.net/) research consortium. The application is aimed at promoting better understanding of bioenergy, and the work of the consortium members, at conferences and events. It allows the user to ask questions of bioenergy researchers, learn about bioenergy concepts and facts, and to understand some of the trade-offs involved in implementing bioenergy in practice.\r\n\r\nMy roles and technical details:\r\n\r\n* Analyzed business needs and communicated with our client\r\n* Contributed on the development and testing of the application\r\n* Employed agile principles\r\n* Progressive Web App (PWA) built using React\r\n* Employed a Central Management System (CMS) hosted on Netlify\r\n* E-2-E and unit tested the app using Cypress and Jest",
    "demo": "https://supergen-bioenergy.netlify.app/\r",
    "company": "Imago Software Company\r",
    "companyLink": "https://imago.cs.manchester.ac.uk/\r",
    "timePeriod": "June - September 2020\r"
  },
  {
    "id": 4,
    "title": "Co-founder and Developer at Skybox\r",
    "date": "November 17, 2021",
    "time": "12:41",
    "thumbnail": "https://media-exp1.licdn.com/dms/image/C560BAQF9jG50EJqzCw/company-logo_200_200/0/1523301317844?e=1645056000&v=beta&t=-yinV7W-CsiT7JADNwyGhya4pCR8fU7Uyf997rSC5yY\r",
    "content": "Skybox is a student-found start-up, that lets you experience the world’s history in just one touch. We implement personalized immersive experiences into museums to provide more vivid and interactive learning experiences for their visitors. \r\n\r\nIn 2018, we launched 2 Virtual Reality (VR) experieneces in the Manchester Museum.\r\n\r\nIn 2019, we expanded our exhibitions to Augmented Reality (AR). Visitors could scan one of 5 exhibition stickers and the mobile app would immerse them into a Augmented Experience where they can interact with the respective exhibition model. Our application was used over 2000 times on the App and Play Store.\r\n\r\nSkybox was part of the AccelerateMe (<https://www.accelerateme.co/>) cohort 2018 /19, where we received funding, office space, and mentorship. Since then, we have appeared at numerous panelist and networking events.\r\n\r\nIn 2020, we won the runner-up award of the Venture Further Creative Competition. \r\n\r\nDue to COVID-19, and the closure of museums, we converted our idea into developing a mobile world-building game.\r\n\r\nIn 2021, we pre-released and beta tested our mobile game. Unfortunately, development has paused since then.\r\n\r\nMy role and technical details:\r\n\r\n* Oversee technical development\r\n* Create a mobile application in Unity",
    "demo": "https://www.youtube.com/watch?v=xJWxjKOu35k\r",
    "company": "Skybox\r",
    "companyLink": "https://twitter.com/SkyboxGame\r",
    "timePeriod": "October 2018 - March 2021\r"
  }
]
