[{"id":1637152380,"title":"Business Analyst at Imago\r","date":"November 17, 2021","time":"12:33","thumbnail":"https://imago.cs.manchester.ac.uk/wp-content/uploads/2020/09/imago-logo-2-300x143.jpg\r","content":"We created a progressive web application using React to introduce members of the public and other interested parties to current issues and innovations in bioenergy, for the [UK Supergen Bioenergy Hub](https://www.supergen-bioenergy.net/) research consortium. The application is aimed at promoting better understanding of bioenergy, and the work of the consortium members, at conferences and events. It allows the user to ask questions of bioenergy researchers, learn about bioenergy concepts and facts, and to understand some of the trade-offs involved in implementing bioenergy in practice.\r\n\r\nMy roles and technical details:\r\n\r\n* Analyzed business needs and communicated with our client\r\n* Contributed on the development and testing of the application\r\n* Employed agile principles\r\n* Progressive Web App (PWA) built using React\r\n* Employed a Central Management System (CMS) hosted on Netlify\r\n* E-2-E and unit tested the app using Cypress and Jest","demo":"https://supergen-bioenergy.netlify.app/\r","company":"Imago Software Company\r","companyLink":"https://imago.cs.manchester.ac.uk/\r","timePeriod":"June - September 2020\r"},{"id":1637086920,"title":"CTO at Yakera\r","date":"November 16, 2021","time":"18:22","thumbnail":"/images/yakeralogo.webp\r","content":"really cool CTO description here","demo":"https://www.yakera.org/\r","company":"Yakera\r","companyLink":"https://www.yakera.org/\r","timePeriod":"March 2020 - present\r"},{"id":1637087700,"title":"Zuhlke Internship\r","date":"November 16, 2021","time":"18:35","thumbnail":"http://www.realwire.com/writeitfiles/Zuehlke_Logo_web.jpg\r","content":"At Zuhlke I worked alongside experienced developers for 3 months. As part of an internal team, our mission was to create the perfect walking application. The final result was Walker: a web app, which suggests the sunniest time of the day to go on a walk. In addition, Walker calculates a route based on user preferences, such as pace, temperature and distance, while always prioritizing green areas. Users are able to record their walks and log them for future references. Try out Walker for yourself: <https://master.d2su8ceb1kjqz8.amplifyapp.com/> (UPDATE: backend has been disconnected)\r\n\r\nIn addition to the development cycles, I was exposed to Masterclasses from professionals in different specialisations. I learnt and got to dive myself into advanced Data Science, Project Management, Consulting, Requirement Gathering and Team Programming Cultures.\r\n\r\nMy role and technical details:\r\n\r\n* Developed a Progressive Web App according to client demands\r\n* Followed professional agile industry standards (XP)\r\n* Built and hosted a full stack web app using React, Django, AWS, MongoDB\r\n* Applied Test Driven Development (TDD), trunk Based Development and Pair Programming\r\n* Conducted User Testing","demo":"https://youtu.be/0AqxVt9O3Pk\r","company":"Zuhlke\r","companyLink":"https://www.zuehlke.com/en\r","timePeriod":"June - September 2021\r"},{"id":1637152440,"title":"CTO at Yakera\r","date":"November 17, 2021","time":"12:34","thumbnail":"/images/yakeralogo.webp\r","content":"really cool CTO description here","demo":"https://www.yakera.org/\r","company":"Yakera\r","companyLink":"https://www.yakera.org/\r","timePeriod":"March 2020 - present\r"}]